upload_performance_result/metrics/sglang/20260801/test_npu_qwen3_32b_w8a8_2p_in3k5_out1k5_50ms_gpqa__20260731.txt
memfabric_hybrid          1.0.8
sgl_kernel_npu            2026.6.1
sglang                    0.5.17.dev426+g5f9b0db18       /sgl-workspace/sglang/python
sglang-router             0.3.2
torch                     2.10.0+cpu
torch_npu                 2.10.0
torchao                   0.9.0
torchaudio                2.10.0+cpu
torchvision               0.25.0+cpu
CANN: 9.0.0
transformers: 5.12.1
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=20166, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/tmp/ShareGPT_V3_unfiltered_cleaned_split.json', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/root/.cache/modelscope/hub/models/aleoyang/Qwen3-32B-w8a8-MindIE', served_model_name=None, tokenizer=None, num_prompts=400, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=3584, random_output_len=1536, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=100, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:20166/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=20166, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/tmp/ShareGPT_V3_unfiltered_cleaned_split.json', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/root/.cache/modelscope/hub/models/aleoyang/Qwen3-32B-w8a8-MindIE', served_model_name=None, tokenizer=None, num_prompts=400, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=3584, random_output_len=1536, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=100, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 1433600
#Output tokens: 614400
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/400 [00:00<?, ?it/s]
  0%|          | 1/400 [01:01<6:48:51, 61.48s/it]
  1%|▏         | 5/400 [01:01<1:00:33,  9.20s/it]
  2%|▏         | 8/400 [01:03<32:50,  5.03s/it]  
  3%|▎         | 11/400 [01:05<21:31,  3.32s/it]
  3%|▎         | 13/400 [01:05<15:36,  2.42s/it]
  4%|▎         | 14/400 [01:05<13:11,  2.05s/it]
  4%|▍         | 15/400 [01:06<11:13,  1.75s/it]
  4%|▍         | 16/400 [01:06<09:03,  1.41s/it]
  4%|▍         | 18/400 [01:06<05:48,  1.10it/s]
  5%|▍         | 19/400 [01:09<08:14,  1.30s/it]
  5%|▌         | 20/400 [01:09<06:35,  1.04s/it]
  6%|▌         | 22/400 [01:09<04:10,  1.51it/s]
  6%|▌         | 24/400 [01:10<02:51,  2.19it/s]
  6%|▋         | 25/400 [01:10<02:52,  2.18it/s]
  7%|▋         | 27/400 [01:10<02:00,  3.10it/s]
  8%|▊         | 30/400 [01:13<03:34,  1.73it/s]
  8%|▊         | 33/400 [01:13<02:32,  2.40it/s]
  9%|▉         | 37/400 [01:16<03:04,  1.97it/s]
 10%|▉         | 38/400 [01:16<02:48,  2.15it/s]
 10%|▉         | 39/400 [01:17<02:59,  2.01it/s]
 10%|█         | 40/400 [01:17<02:56,  2.04it/s]
 10%|█         | 41/400 [01:18<02:47,  2.14it/s]
 11%|█         | 44/400 [01:18<01:43,  3.44it/s]
 11%|█▏        | 45/400 [01:18<01:36,  3.69it/s]
 12%|█▏        | 46/400 [01:21<04:35,  1.29it/s]
 12%|█▏        | 48/400 [01:21<03:04,  1.91it/s]
 12%|█▏        | 49/400 [01:21<02:52,  2.03it/s]
 12%|█▎        | 50/400 [01:22<02:50,  2.06it/s]
 13%|█▎        | 51/400 [01:22<02:23,  2.43it/s]
 13%|█▎        | 53/400 [01:22<01:43,  3.35it/s]
 14%|█▎        | 54/400 [01:22<01:33,  3.68it/s]
 14%|█▍        | 55/400 [01:25<04:25,  1.30it/s]
 14%|█▍        | 56/400 [01:25<03:56,  1.46it/s]
 14%|█▍        | 57/400 [01:25<03:09,  1.81it/s]
 15%|█▍        | 59/400 [01:26<02:13,  2.55it/s]
 15%|█▌        | 60/400 [01:27<02:56,  1.93it/s]
 15%|█▌        | 61/400 [01:27<02:34,  2.19it/s]
 16%|█▌        | 64/400 [01:30<04:17,  1.31it/s]
 16%|█▋        | 65/400 [01:31<04:21,  1.28it/s]
 16%|█▋        | 66/400 [01:32<04:18,  1.29it/s]
 17%|█▋        | 67/400 [01:32<03:53,  1.43it/s]
 17%|█▋        | 68/400 [01:32<03:09,  1.76it/s]
 18%|█▊        | 70/400 [01:32<02:01,  2.72it/s]
 18%|█▊        | 71/400 [01:33<01:46,  3.08it/s]
 18%|█▊        | 74/400 [01:36<03:49,  1.42it/s]
 19%|█▉        | 75/400 [01:37<03:51,  1.40it/s]
 19%|█▉        | 76/400 [01:38<04:19,  1.25it/s]
 19%|█▉        | 77/400 [01:39<04:34,  1.17it/s]
 20%|█▉        | 78/400 [01:40<04:32,  1.18it/s]
 20%|█▉        | 79/400 [01:40<03:59,  1.34it/s]
 20%|██        | 80/400 [01:41<04:28,  1.19it/s]
 20%|██        | 81/400 [01:45<08:39,  1.63s/it]
 20%|██        | 82/400 [01:46<08:30,  1.61s/it]
 21%|██        | 83/400 [01:49<09:45,  1.85s/it]
 21%|██        | 84/400 [01:49<07:18,  1.39s/it]
 21%|██▏       | 85/400 [01:50<06:09,  1.17s/it]
 22%|██▏       | 86/400 [01:53<08:43,  1.67s/it]
 22%|██▏       | 87/400 [01:53<06:50,  1.31s/it]
 22%|██▏       | 88/400 [01:54<06:22,  1.23s/it]
 22%|██▏       | 89/400 [01:55<05:18,  1.03s/it]
 22%|██▎       | 90/400 [01:55<04:25,  1.17it/s]
 23%|██▎       | 91/400 [01:55<03:30,  1.47it/s]
 23%|██▎       | 93/400 [01:58<04:56,  1.03it/s]
 24%|██▎       | 94/400 [01:58<03:56,  1.29it/s]
 24%|██▍       | 95/400 [01:59<03:54,  1.30it/s]
 24%|██▍       | 96/400 [02:01<06:19,  1.25s/it]
 24%|██▍       | 97/400 [02:03<06:07,  1.21s/it]
 24%|██▍       | 98/400 [02:03<04:37,  1.09it/s]
 25%|██▍       | 99/400 [02:03<03:57,  1.27it/s]
 25%|██▌       | 101/400 [02:08<07:00,  1.41s/it]
 26%|██▌       | 102/400 [02:08<05:30,  1.11s/it]
 26%|██▌       | 104/400 [02:09<04:04,  1.21it/s]
 26%|██▋       | 105/400 [02:09<03:27,  1.42it/s]
 26%|██▋       | 106/400 [02:09<02:56,  1.67it/s]
 27%|██▋       | 107/400 [02:10<03:13,  1.51it/s]
 27%|██▋       | 108/400 [02:10<02:35,  1.88it/s]
 27%|██▋       | 109/400 [02:10<02:06,  2.30it/s]
 28%|██▊       | 110/400 [02:13<05:21,  1.11s/it]
 28%|██▊       | 112/400 [02:13<03:14,  1.48it/s]
 28%|██▊       | 113/400 [02:14<03:19,  1.44it/s]
 29%|██▉       | 115/400 [02:15<02:24,  1.98it/s]
 29%|██▉       | 117/400 [02:15<01:40,  2.83it/s]
 30%|██▉       | 118/400 [02:15<01:29,  3.14it/s]
 30%|██▉       | 119/400 [02:18<03:57,  1.18it/s]
 30%|███       | 121/400 [02:18<02:48,  1.66it/s]
 31%|███       | 123/400 [02:19<02:22,  1.95it/s]
 31%|███       | 124/400 [02:19<02:00,  2.29it/s]
 31%|███▏      | 125/400 [02:21<03:09,  1.45it/s]
 32%|███▏      | 126/400 [02:21<03:23,  1.34it/s]
 32%|███▏      | 128/400 [02:24<04:35,  1.01s/it]
 32%|███▏      | 129/400 [02:25<04:18,  1.05it/s]
 33%|███▎      | 131/400 [02:26<03:20,  1.34it/s]
 33%|███▎      | 132/400 [02:26<02:46,  1.61it/s]
 34%|███▍      | 135/400 [02:26<01:36,  2.74it/s]
 34%|███▍      | 136/400 [02:27<01:40,  2.62it/s]
 34%|███▍      | 137/400 [02:30<04:10,  1.05it/s]
 34%|███▍      | 138/400 [02:31<04:26,  1.02s/it]
 35%|███▍      | 139/400 [02:31<03:37,  1.20it/s]
 35%|███▌      | 140/400 [02:32<02:58,  1.45it/s]
 35%|███▌      | 141/400 [02:32<02:42,  1.59it/s]
 36%|███▌      | 143/400 [02:33<02:16,  1.88it/s]
 36%|███▌      | 144/400 [02:33<02:00,  2.13it/s]
 36%|███▋      | 145/400 [02:34<02:46,  1.53it/s]
 36%|███▋      | 146/400 [02:37<05:03,  1.19s/it]
 37%|███▋      | 147/400 [02:38<04:44,  1.12s/it]
 37%|███▋      | 148/400 [02:39<04:37,  1.10s/it]
 37%|███▋      | 149/400 [02:42<06:20,  1.52s/it]
 38%|███▊      | 150/400 [02:43<06:31,  1.57s/it]
 38%|███▊      | 151/400 [02:44<05:03,  1.22s/it]
 38%|███▊      | 152/400 [02:44<03:46,  1.10it/s]
 38%|███▊      | 153/400 [02:44<03:18,  1.24it/s]
 38%|███▊      | 154/400 [02:46<04:14,  1.03s/it]
 39%|███▉      | 155/400 [02:50<07:16,  1.78s/it]
 39%|███▉      | 157/400 [02:50<04:09,  1.03s/it]
 40%|███▉      | 159/400 [02:51<03:46,  1.07it/s]
 40%|████      | 160/400 [02:52<03:10,  1.26it/s]
 40%|████      | 161/400 [02:53<03:27,  1.15it/s]
 41%|████      | 164/400 [02:55<03:27,  1.14it/s]
 41%|████▏     | 165/400 [02:56<02:55,  1.34it/s]
 42%|████▏     | 167/400 [02:56<02:15,  1.72it/s]
 42%|████▏     | 168/400 [02:56<02:00,  1.93it/s]
 42%|████▏     | 169/400 [02:57<02:16,  1.69it/s]
 43%|████▎     | 171/400 [02:58<01:43,  2.22it/s]
 43%|████▎     | 173/400 [03:00<02:45,  1.37it/s]
 44%|████▎     | 174/400 [03:01<02:36,  1.44it/s]
 44%|████▍     | 175/400 [03:02<03:26,  1.09it/s]
 44%|████▍     | 176/400 [03:03<02:56,  1.27it/s]
 44%|████▍     | 177/400 [03:05<04:14,  1.14s/it]
 44%|████▍     | 178/400 [03:05<03:27,  1.07it/s]
 45%|████▍     | 179/400 [03:07<03:48,  1.03s/it]
 45%|████▌     | 180/400 [03:07<03:05,  1.19it/s]
 45%|████▌     | 181/400 [03:07<02:28,  1.47it/s]
 46%|████▌     | 182/400 [03:10<04:20,  1.19s/it]
 46%|████▌     | 183/400 [03:10<03:26,  1.05it/s]
 46%|████▌     | 184/400 [03:10<02:36,  1.38it/s]
 46%|████▋     | 185/400 [03:11<02:13,  1.61it/s]
 46%|████▋     | 186/400 [03:12<02:45,  1.30it/s]
 47%|████▋     | 187/400 [03:12<02:19,  1.53it/s]
 48%|████▊     | 190/400 [03:12<01:07,  3.11it/s]
 48%|████▊     | 191/400 [03:15<02:52,  1.21it/s]
 48%|████▊     | 192/400 [03:16<02:39,  1.31it/s]
 48%|████▊     | 193/400 [03:17<03:17,  1.05it/s]
 48%|████▊     | 194/400 [03:18<03:05,  1.11it/s]
 49%|████▉     | 196/400 [03:18<01:57,  1.74it/s]
 49%|████▉     | 197/400 [03:20<02:30,  1.35it/s]
 50%|████▉     | 198/400 [03:20<02:06,  1.60it/s]
 50%|████▉     | 199/400 [03:20<01:57,  1.72it/s]
 50%|█████     | 200/400 [03:23<03:38,  1.09s/it]
 50%|█████     | 201/400 [03:23<02:56,  1.13it/s]
 51%|█████     | 203/400 [03:23<01:49,  1.80it/s]
 51%|█████▏    | 205/400 [03:24<01:23,  2.33it/s]
 52%|█████▏    | 207/400 [03:25<01:24,  2.28it/s]
 52%|█████▏    | 208/400 [03:25<01:17,  2.46it/s]
 52%|█████▏    | 209/400 [03:28<03:01,  1.05it/s]
 53%|█████▎    | 211/400 [03:28<02:13,  1.41it/s]
 53%|█████▎    | 212/400 [03:29<01:59,  1.57it/s]
 53%|█████▎    | 213/400 [03:29<01:38,  1.89it/s]
 54%|█████▎    | 214/400 [03:30<01:44,  1.79it/s]
 54%|█████▍    | 215/400 [03:30<01:51,  1.65it/s]
 54%|█████▍    | 217/400 [03:31<01:21,  2.26it/s]
 55%|█████▍    | 218/400 [03:34<03:22,  1.11s/it]
 55%|█████▍    | 219/400 [03:35<02:47,  1.08it/s]
 55%|█████▌    | 221/400 [03:35<01:57,  1.52it/s]
 56%|█████▌    | 222/400 [03:37<02:46,  1.07it/s]
 56%|█████▌    | 224/400 [03:38<02:01,  1.44it/s]
 56%|█████▋    | 225/400 [03:38<01:52,  1.56it/s]
 57%|█████▋    | 228/400 [03:41<02:27,  1.16it/s]
 57%|█████▋    | 229/400 [03:42<02:14,  1.27it/s]
 58%|█████▊    | 231/400 [03:42<01:45,  1.60it/s]
 58%|█████▊    | 232/400 [03:44<02:11,  1.28it/s]
 58%|█████▊    | 233/400 [03:44<01:48,  1.54it/s]
 58%|█████▊    | 234/400 [03:44<01:32,  1.79it/s]
 59%|█████▉    | 235/400 [03:45<01:46,  1.54it/s]
 59%|█████▉    | 237/400 [03:48<02:43,  1.00s/it]
 60%|█████▉    | 238/400 [03:48<02:11,  1.23it/s]
 60%|█████▉    | 239/400 [03:49<01:45,  1.52it/s]
 60%|██████    | 240/400 [03:49<01:29,  1.79it/s]
 60%|██████    | 241/400 [03:49<01:20,  1.97it/s]
 60%|██████    | 242/400 [03:50<01:30,  1.74it/s]
 61%|██████▏   | 245/400 [03:51<00:58,  2.64it/s]
 62%|██████▏   | 246/400 [03:57<04:05,  1.60s/it]
 62%|██████▏   | 247/400 [03:58<03:35,  1.41s/it]
 62%|██████▏   | 248/400 [03:58<03:09,  1.25s/it]
 62%|██████▏   | 249/400 [03:59<02:26,  1.03it/s]
 62%|██████▎   | 250/400 [03:59<01:54,  1.32it/s]
 63%|██████▎   | 251/400 [04:00<02:00,  1.24it/s]
 63%|██████▎   | 252/400 [04:01<02:08,  1.16it/s]
 64%|██████▍   | 255/400 [04:03<02:04,  1.16it/s]
 64%|██████▍   | 256/400 [04:04<02:00,  1.19it/s]
 64%|██████▍   | 257/400 [04:05<02:00,  1.19it/s]
 64%|██████▍   | 258/400 [04:07<02:38,  1.12s/it]
 65%|██████▍   | 259/400 [04:08<02:20,  1.00it/s]
 65%|██████▌   | 260/400 [04:08<02:03,  1.14it/s]
 65%|██████▌   | 261/400 [04:09<01:46,  1.31it/s]
 66%|██████▌   | 262/400 [04:09<01:29,  1.54it/s]
 66%|██████▌   | 263/400 [04:10<01:54,  1.20it/s]
 66%|██████▌   | 264/400 [04:13<03:11,  1.41s/it]
 66%|██████▋   | 265/400 [04:14<02:36,  1.16s/it]
 66%|██████▋   | 266/400 [04:14<02:04,  1.07it/s]
 67%|██████▋   | 267/400 [04:14<01:34,  1.41it/s]
 67%|██████▋   | 268/400 [04:15<01:42,  1.29it/s]
 67%|██████▋   | 269/400 [04:16<01:29,  1.46it/s]
 68%|██████▊   | 270/400 [04:17<01:59,  1.09it/s]
 68%|██████▊   | 272/400 [04:17<01:11,  1.79it/s]
 68%|██████▊   | 273/400 [04:20<02:18,  1.09s/it]
 68%|██████▊   | 274/400 [04:20<01:47,  1.17it/s]
 69%|██████▉   | 275/400 [04:21<01:33,  1.33it/s]
 69%|██████▉   | 276/400 [04:21<01:23,  1.49it/s]
 69%|██████▉   | 277/400 [04:22<01:15,  1.63it/s]
 70%|██████▉   | 278/400 [04:22<01:06,  1.83it/s]
 70%|██████▉   | 279/400 [04:23<01:29,  1.36it/s]
 70%|███████   | 280/400 [04:24<01:25,  1.41it/s]
 70%|███████   | 282/400 [04:27<01:57,  1.00it/s]
 71%|███████   | 283/400 [04:27<01:47,  1.09it/s]
 71%|███████▏  | 285/400 [04:27<01:08,  1.68it/s]
 72%|███████▏  | 286/400 [04:28<00:57,  1.99it/s]
 72%|███████▏  | 287/400 [04:28<00:55,  2.02it/s]
 72%|███████▏  | 288/400 [04:28<00:46,  2.41it/s]
 72%|███████▏  | 289/400 [04:29<00:44,  2.49it/s]
 72%|███████▎  | 290/400 [04:29<00:51,  2.13it/s]
 73%|███████▎  | 291/400 [04:32<02:05,  1.15s/it]
 73%|███████▎  | 292/400 [04:33<01:45,  1.02it/s]
 73%|███████▎  | 293/400 [04:34<01:49,  1.03s/it]
 74%|███████▎  | 294/400 [04:35<01:46,  1.00s/it]
 74%|███████▍  | 295/400 [04:36<01:47,  1.02s/it]
 74%|███████▍  | 296/400 [04:36<01:29,  1.16it/s]
 74%|███████▍  | 298/400 [04:37<00:53,  1.89it/s]
 75%|███████▍  | 299/400 [04:37<00:44,  2.25it/s]
 75%|███████▌  | 300/400 [04:39<01:41,  1.01s/it]
 75%|███████▌  | 301/400 [04:40<01:30,  1.09it/s]
 76%|███████▌  | 302/400 [04:41<01:22,  1.18it/s]
 76%|███████▌  | 303/400 [04:41<01:14,  1.30it/s]
 76%|███████▌  | 304/400 [04:42<01:02,  1.53it/s]
 77%|███████▋  | 307/400 [04:42<00:33,  2.77it/s]
 77%|███████▋  | 308/400 [04:42<00:29,  3.09it/s]
 78%|███████▊  | 310/400 [04:44<00:51,  1.74it/s]
 78%|███████▊  | 311/400 [04:45<00:44,  2.01it/s]
 78%|███████▊  | 312/400 [04:46<00:59,  1.49it/s]
 78%|███████▊  | 313/400 [04:46<00:53,  1.62it/s]
 78%|███████▊  | 314/400 [04:47<00:53,  1.61it/s]
 79%|███████▉  | 315/400 [04:47<00:46,  1.82it/s]
 79%|███████▉  | 316/400 [04:48<00:52,  1.61it/s]
 79%|███████▉  | 317/400 [04:48<00:41,  2.02it/s]
 80%|███████▉  | 318/400 [04:49<00:41,  1.98it/s]
 80%|███████▉  | 319/400 [04:49<00:43,  1.87it/s]
 80%|████████  | 320/400 [04:50<00:40,  1.97it/s]
 80%|████████  | 321/400 [04:50<00:40,  1.95it/s]
 80%|████████  | 322/400 [04:52<01:04,  1.20it/s]
 81%|████████  | 323/400 [04:52<00:50,  1.51it/s]
 81%|████████  | 324/400 [04:52<00:43,  1.76it/s]
 81%|████████▏ | 325/400 [04:53<00:49,  1.51it/s]
 82%|████████▏ | 327/400 [04:54<00:34,  2.10it/s]
 82%|████████▏ | 329/400 [04:54<00:28,  2.49it/s]
 82%|████████▎ | 330/400 [04:55<00:35,  1.97it/s]
 83%|████████▎ | 331/400 [04:56<00:33,  2.07it/s]
 84%|████████▎ | 334/400 [04:56<00:17,  3.77it/s]
 84%|████████▍ | 335/400 [04:57<00:24,  2.70it/s]
 84%|████████▍ | 338/400 [04:57<00:18,  3.32it/s]
 85%|████████▍ | 339/400 [04:58<00:16,  3.66it/s]
 85%|████████▌ | 340/400 [04:58<00:20,  2.87it/s]
 85%|████████▌ | 341/400 [04:58<00:17,  3.31it/s]
 86%|████████▌ | 342/400 [04:59<00:23,  2.52it/s]
 86%|████████▌ | 344/400 [04:59<00:17,  3.28it/s]
 86%|████████▋ | 345/400 [05:00<00:20,  2.65it/s]
 86%|████████▋ | 346/400 [05:00<00:20,  2.59it/s]
 87%|████████▋ | 347/400 [05:01<00:19,  2.66it/s]
 87%|████████▋ | 348/400 [05:01<00:20,  2.59it/s]
 87%|████████▋ | 349/400 [05:02<00:23,  2.13it/s]
 88%|████████▊ | 350/400 [05:02<00:22,  2.20it/s]
 88%|████████▊ | 352/400 [05:03<00:14,  3.20it/s]
 88%|████████▊ | 354/400 [05:03<00:09,  4.62it/s]
 89%|████████▉ | 355/400 [05:03<00:14,  3.21it/s]
 89%|████████▉ | 356/400 [05:05<00:23,  1.88it/s]
 89%|████████▉ | 357/400 [05:05<00:18,  2.33it/s]
 90%|████████▉ | 358/400 [05:05<00:15,  2.72it/s]
 90%|█████████ | 360/400 [05:07<00:30,  1.29it/s]
 90%|█████████ | 361/400 [05:08<00:28,  1.35it/s]
 90%|█████████ | 362/400 [05:08<00:22,  1.70it/s]
 91%|█████████ | 363/400 [05:09<00:26,  1.41it/s]
 91%|█████████ | 364/400 [05:10<00:22,  1.61it/s]
 91%|█████████▏| 365/400 [05:10<00:16,  2.08it/s]
 92%|█████████▏| 366/400 [05:10<00:17,  1.99it/s]
 92%|█████████▏| 367/400 [05:11<00:15,  2.16it/s]
 92%|█████████▏| 369/400 [05:11<00:09,  3.20it/s]
 92%|█████████▎| 370/400 [05:14<00:26,  1.12it/s]
 93%|█████████▎| 371/400 [05:14<00:23,  1.23it/s]
 93%|█████████▎| 373/400 [05:14<00:13,  1.97it/s]
 94%|█████████▎| 374/400 [05:15<00:13,  1.96it/s]
 94%|█████████▍| 375/400 [05:16<00:15,  1.62it/s]
 94%|█████████▍| 376/400 [05:16<00:13,  1.80it/s]
 94%|█████████▍| 378/400 [05:16<00:07,  2.89it/s]
 95%|█████████▍| 379/400 [05:18<00:11,  1.85it/s]
 95%|█████████▌| 381/400 [05:18<00:07,  2.60it/s]
 96%|█████████▌| 382/400 [05:18<00:06,  2.97it/s]
 96%|█████████▌| 383/400 [05:18<00:05,  3.25it/s]
 96%|█████████▌| 384/400 [05:19<00:08,  1.98it/s]
 96%|█████████▋| 386/400 [05:20<00:06,  2.05it/s]
 97%|█████████▋| 387/400 [05:21<00:06,  1.99it/s]
 97%|█████████▋| 388/400 [05:21<00:06,  1.92it/s]
 97%|█████████▋| 389/400 [05:22<00:06,  1.67it/s]
 98%|█████████▊| 390/400 [05:22<00:04,  2.06it/s]
 98%|█████████▊| 391/400 [05:23<00:04,  2.10it/s]
 98%|█████████▊| 392/400 [05:24<00:04,  1.73it/s]
 98%|█████████▊| 393/400 [05:24<00:03,  2.04it/s]
 98%|█████████▊| 394/400 [05:24<00:02,  2.34it/s]
 99%|█████████▉| 395/400 [05:26<00:03,  1.41it/s]
 99%|█████████▉| 396/400 [05:27<00:03,  1.28it/s]
 99%|█████████▉| 397/400 [05:27<00:01,  1.64it/s]
100%|█████████▉| 398/400 [05:28<00:01,  1.18it/s]
100%|█████████▉| 399/400 [05:28<00:00,  1.53it/s]
100%|██████████| 400/400 [05:29<00:00,  1.65it/s]
100%|██████████| 400/400 [05:29<00:00,  1.21it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 100       
Successful requests:                     400       
Benchmark duration (s):                  329.43    
Total input tokens:                      1433600   
Total input text tokens:                 1433600   
Total generated tokens:                  614400    
Total generated tokens (retokenized):    613788    
Request throughput (req/s):              1.21      
Input token throughput (tok/s):          4351.82   
Output token throughput (tok/s):         1865.06   
Peak output token throughput (tok/s):    3843.00   
Peak concurrent requests:                107       
Total token throughput (tok/s):          6216.88   
Concurrency:                             92.18     
Accept length:                           2.93      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   75914.94  
Median E2E Latency (ms):                 71995.71  
P90 E2E Latency (ms):                    103649.53 
P95 E2E Latency (ms):                    113184.91 
P99 E2E Latency (ms):                    123309.44 
---------------Time to First Token----------------
Mean TTFT (ms):                          7387.65   
Median TTFT (ms):                        4697.24   
P90 TTFT (ms):                           18046.79  
P95 TTFT (ms):                           22819.45  
P99 TTFT (ms):                           25245.01  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          44.64     
Median TPOT (ms):                        42.00     
P90 TPOT (ms):                           62.38     
P95 TPOT (ms):                           68.84     
P99 TPOT (ms):                           76.53     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           44.64     
Median ITL (ms):                         23.58     
P90 ITL (ms):                            47.65     
P95 ITL (ms):                            93.37     
P99 ITL (ms):                            587.32    
Max ITL (ms):                            19888.08  
==================================================

# [collect_metrics] 文件原始修改时间: 2026-08-01 02:21:13
# [collect_metrics] 源目录日期: 20260731